In [9]:
# import modules and libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [10]:
data = pd.read_csv('car_data.csv')
data.head(10)

,name,price,mileage,colour,transmission
0,2000 BUICK CENTURY CUSTOM Sedan 4 Door,$ 357,1,CHAMPAGNE,Automatic
1,2004 HONDA CIVIC LX,$ 850,134095.0,GRAY,AUTOMATIC
2,1993 FORD MUSTANG LX,$ 975,99086.0,WHITE,AUTOMATIC
3,1998 HONDA CR-V LX,$ 925,194018.0,BLUE,AUTOMATIC
4,1999 CHEVROLET TAHOE K1500 Wagon 4 Door,$ 750,264054,GRAY,Automatic
5,2004 HONDA CIVIC EX,"$ 1,000",0.0,GRAY,AUTOMATIC
6,2009 DODGE JOURNEY SE Wagon 4 Door,"$ 1,000",216676,GREEN,Automatic
7,2002 HONDA ACCORD EX,$ 725,218985.0,BLACK,AUTOMATIC
8,2002 DODGE DAKOTA BAS,$ 900,157868.0,BLUE,AUTOMATIC
9,2006 HYUNDAI ACCENT GLS,$ 950,145902.0,BLUE,AUTOMATIC

In [11]:
data.shape

(2054, 5)

In [12]:
data.describe()

                                  name  price mileage  colour transmission
count                             2054   2054    2034    2043         2036
unique                             455     34     464      23            6
top     2006 CADILLAC DTS Sedan 4 Door  $ 800     0.0  SILVER    AUTOMATIC
freq                                24    177     171     362          978

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2054 entries, 0 to 2053
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          2054 non-null   object
 1   price         2054 non-null   object
 2   mileage       2034 non-null   object
 3   colour        2043 non-null   object
 4   transmission  2036 non-null   object
dtypes: object(5)
memory usage: 80.4+ KB

In [14]:
data.isnull().sum()

name             0
price            0
mileage         20
colour          11
transmission    18
dtype: int64

We have to deal with the zero values in the mileage, colour and transmission columns.

In [15]:
data['make'] = data['name'].apply(lambda x: x.split(' ')[1])
data['make'].head()

0        BUICK
1        HONDA
2         FORD
3        HONDA
4    CHEVROLET
Name: make, dtype: object